{
  "1.pdf": "Overview:
  The goal of AWS Cloud Club MJCET is to teach students about the AWS Cloud and its various use
  cases, including those related to Artificial Intelligence, Machine Learning, Business Analytics, the
  Internet of Things, and Security. We will teach students about the benefits of the
  cloud and how it accelerates business.
  Furthermore, the AWS Cloud Club will give students hands-on experience through
  projects in the AWS Cloud, allowing students to develop both technical and business expertise in
  the cloud. This club will provide students with industry skills currently in high demand.
  
  Mission:
  AWS Cloud Clubs aims to provide a platform for students to learn about AWS technologies
  and cloud computing while fostering a community where they can network and collaborate
  with their peers. AWS Cloud Clubs are open to any learner aged 18+ and are regionally
  based, serving the needs of students locally
  Cloud Club Captains are student leaders who partner with their local educational
  communities to launch these clubs. They are responsible for organizing events,
  promoting the club within their institution or community, and maintaining an active
  online presence for the club on platforms like Dev.to, LinkedIn, and Meetup
  AWS Cloud Clubs offer a suite of benefits to Captains, including AWS exam vouchers,
  AWS credits, exclusive experiences in partnership with AWS employees, opportunities
  for speaking and workshops, special Cloud Club Captain swag, professional coaching,
  and more",


  "2.pdf": "INAUGURAL CEREMONY
INTRODUCTION TO AWS
Amazon Web Services (AWS) is a comprehensive and widely adopted cloud
platform, offering over 200 fully-featured services from data centers globally.
AWS enables organizations and individuals to leverage cloud computing's
power for tasks such as computing, storage, machine learning, artificial
intelligence, and security. It supports businesses of all sizes in scaling and
innovating faster by providing flexible, scalable, and cost-effective
infrastructure.
INTRODUCTION TO AWS CLOUD CLUB
AWS Cloud Clubs are academic communities aimed at fostering a passion for
cloud computing among students. These clubs provide resources, training, and
hands-on opportunities to learn AWS technologies, helping members develop the
essential skills needed for a successful career in the cloud computing industry.
AWS Cloud Clubs also offer a platform for members to collaborate, innovate, and
interact with industry experts and like-minded peers, creating a dynamic ecosystem
for growth.
OVERVIEW OF AWS CLOUD CLUB MJCET:
The AWS Cloud Club at MJCET is the first of its kind in Telangana, helps
students build cloud computing skills through hands-on training and AWS
technologies. It offers opportunities for real-world projects, expert-led
workshops, and collaboration, empowering members to succeed in the cloud
industry.
BENEFITS OF JOINING:
Enhance and cultivate essential cloud competencies in architecture, deployment,
and service management. Benefit from exclusive access to AWS tools and
resources. Establish connections with industry experts, peers, and prospective
employers.
COMMENCEMENT OF THE INAUGURAL EVENT:
On ,wehostedanengagingeventfrom at
28thJune2024
10:00AMto12:00PMBlock 4 Seminar Hall
the .Attendeeshadtheopportunitytoconnect,learn,and
collaborate on various topics related to cloud computing and Amazon Web
Services (AWS).
The inauguration of our club featured the esteemed presence of Mr. Faizal
Khan, Community Lead of the AWS User Group and AWS Community Hero, as
the distinguished Chief Guest.
Mr. Faizal Khan provided an insightful introduction to the club, emphasizing its
significance in fostering collaboration and innovation within the field of cloud
computing. He highlighted the club's role in equipping members with essential
skills, facilitating networking opportunities, and enhancing access to valuable
resources and training related to Amazon Web Services (AWS).
The governing body of the AWS Club was announed, detailing its members and
their roles, and emphasizing their commitment to guiding the club’s mission and
initiatives.
GOVERNINGBODYOFAWS:
● Captain
: Syed Omer Shah
● Vice Captain
: Danish Mohiuddin
● Secretary
: Maria Ashfaq
● Chief Coordinator
: Ihsan Ilahi Maqbool
● Chief Representative: Unaisah Noor
● Outreach Director: Zayab Ahmed
● Technical Coordinator: Nameera Mohammed
● Treasurer: Syeda Zoya
He concluded the ceremony by expressing his gratitude to all attendees for their
participation and enthusiasm. Mr. Khan encouraged members to actively engage
with the club's activities and to collaborate in fostering a vibrant community
dedicated to cloud computing and innovation.
Acknowledgment to the CS&AI Department:
We sincerely thank the Department of Computer Science & Artificial Intelligence
(CS&AI), MJCET, for their pivotal role in the successful launch of the AWS
Cloud Computing Club. Led by Mrs. Uma N. Dulhare, HOD of CS&AI, the
department has been at the forefront of promoting cloud computing, AI, and
emerging technologies. Their commitment to fostering a culture of innovation
and providing platforms like the AWS Club has enabled students to gain
hands-on experience in cloud technologies, AWS services, and cloud
architecture. We deeply appreciate their unwavering support in creating
opportunities for practical learning and skill development, driving us toward a
future of technological excellence.
IMAGIFY 2.0
IMAGIFY 2.0, organized by IEEE SMC MJCET in collaboration with
AWS CC MJCET, took place on 26th July 2024 at MJCET. The event
aimed to explore the latest trends in artificial intelligence and machine
learning, offering participants both theoretical insights and practical
experience. With sessions on Generative AI, Prompt Engineering,
Vision-Language Models, and AWS services, the event successfully
bridged the gap between AI concepts and real-world applications.
Content of the event:
1. Generative AI:
IMAGIFY 2.0 kicked off with an intriguing dive
into Generative AI, presented by Fatima Saleem. Her session was a
highlight, showcasing how AI models can create everything from
images to music and text. The excitement was palpable as she
demonstrated how these technologies are transforming industries
and sparking creativity.
2.
Prompt Engineering: Next, Hurriya Subhan guided
participants through Prompt Engineering, explaining how to
effectively interact with AI. Hurriya’s practical tips demonstrated
the importance of crafting precise prompts for optimal AI results,
making this session engaging and educational.
3.
Vision-Language Models (VLMs): Vahaj Ur Rahman
introduced Vision-Language Models, revealing how these models
combine visual and textual data to perform tasks like caption
generation and question answering. His clear explanations
showcased the potential of integrating sight and language for AI
applications.
4.Introduction to AWS Services: Uzair Khan presented the
benefits of AWS services, emphasizing their scalability and
flexibility for AI projects. His session highlighted how AWS
infrastructure supports innovation, making it easier for
developers to bring AI ideas to life.
5.
6.
7.
Stable Diffusion & Bedrock: Imran Ahmed demonstrated the
latest advancements in image generation with Stable Diffusion
and Bedrock, showing how text prompts can create stunning
visuals. His practical examples excited participants about the
creative possibilities in digital art and marketing.
Hands-On Session: Abdullah Hussain Shaikh led an
interactive session where participants used the BLIP model from
Salesforce to generate captions and Google’s Gemini model to
transform them into stories and poems. This hands-on experience
was both fun and educational, providing practical AI exposure.
AWS Party-Rock: The event concluded with the dynamic
PartyRock session, led by Mohd Abdul Moid, where
participants explored AWS tools in a fun, creative atmosphere.
The session left attendees energized, wrapping up IMAGIFY 2.0
with a perfect blend of learning and enjoyment.
Closure of the Event:
IMAGIFY 2.0
As cametoanend,itssuccesswasundeniable.Theday
was filled with captivating sessions, interactive learning, and vibrant
discussions, leaving everyone inspired. The dynamic AWS Party-Rock
session provided a fitting end, reflecting the event's innovative spirit.
A heartfelt thank you to all the speakers, organizers, and participants
who made IMAGIFY 2.0 a resounding success. The knowledge and
experiences gained will continue to fuel further exploration and
innovation in AI and machine learning.
Acknowledgment to the CS&AI Department:
We express our sincere gratitude to the
Department of Computer
Science & Artificial Intelligence (CS&AI), MJCET
, for their crucial
roleinmaking
IMAGIFY 2.0
aresoundingsuccess.Underthe
visionaryleadershipof
Mrs. Uma N. Dulhare
,HODofCS&AI,the
department has continually fostered an environment of innovation and
academic excellence. Their commitment to advancing AI and machine
learning, along with their support in providing platforms like
IMAGIFY 2.0 for students to explore and apply their knowledge, has
been instrumental in the event's success. We deeply appreciate their
unwavering encouragement and guidance.
ORIENTATIONDAY
EVENT OVERVIEW:
On August 17, 2024, the AWS Club held a pivotal meeting at SU HUB
from 11:00 am to 3:30 pm. The gathering aimed to foster collaboration
and ensure alignment with the club’s objectives. The event featured the
introduction of the governing body, Execom, and core members,
followed by a discussion of the club’s rules emphasizing respect,
humility, and confidentiality.
Key highlights included the announcement of an industrial visit to
Amazon’s office and a Bootcamp offering AWS certifications. The
meeting concluded with a lively ice-breaking session,
“Heads Up,
”
which helped strengthen bonds among members, with the winners
receiving surprise rewards.
Introduction to the Portfolios of the AWS Club:
The AWS Club is structured into several key portfolios, each with specific
responsibilities to ensure the smooth operation and growth of the club. These
portfolios are headed by passionate members with expertise in cloud
computing and other relevant fields.
ExecomTeam
The Executive Committee (Execom) team oversees the technical and
non-technical wings of the club, ensuring that all projects, events, and
initiatives are executed effectively. Each leader is specialized in a key
technical domain, making the Execom team the club's backbone.
● Cloud Lead: Syed Furqaan Hussain
Responsible for cloud computing initiatives, including AWS resources and
infrastructure management.
● Cloud Security Lead: Ikram Hyderi
Ensures the club's cloud activities are secure, overseeing data protection and
cloud security measures.
● Dev Lead: Uzair Khan
Heads the software development efforts, managing web-based projects and
app development.
● ML Lead: Mohammed Omer
Leads machine learning projects and provides technical guidance on AI
initiatives.
● DS Lead: Mir Nabeel Uddin
Oversees data science operations, focusing on data analysis and predictive
modeling.
● IOT Lead: Imran Ahmed
Guides projects focused on the Internet of Things, linking cloud
technologies with IoT applications.
● Design Head: Bilal Hussain Anwar
Responsible for all design-related tasks, ensuring that the club's materials are
visually appealing and professional.
● Marketing Head: Abdullah Shareef Manages the club's outreach and
promotion efforts, ensuring that the AWS Club’s activities reach a broad
audience.
● Events Head: Danish Asif Ahmed
Oversees the planning and execution of all club events, ensuring they run
smoothly and are well-organized.
● Media Head: Tuba Fatima
Leads the media team, responsible for documenting the club’s activities and
managing its social media presence.
● Documentation Head: Afhamullah Shaik Mohammed
Ensures proper record-keeping and documentation of all meetings, events,
and club activities.
Core Members
Core members provide vital support to the Execom team, contributing their
specialized knowledge and skills to drive the club's projects forward.
●Cloud: Tahir Khan Gooty, Tasneem Sultana
●Cloud Security: Mohammed Nouman, Shaik Abdul Sami
●Development: Shahnawaz Alam, Shaik Abrar
●Machine Learning: Sariah Fatima, Saad Riyan, Musab Umayr
●Data Science: Abdullah Shaikh, Ahlam Saher, Nabeel Rizwan
●IOT: Vahaj Ur Rahman, Abdullah Hafeez
●Design: Syed Abdur Rahman, Juweria Ashfaq, Faraaz Hashmi
●Marketing: Adnan Shareef, Syeda Luba Falak
●Events: Abdullah Yar Khan, Sidra Aleem, Zaid Ali Khan
●Media: Mohammed Soheb, Hanaan Shah, Hamza Mohammed
●Documentation: Nooren Fatima, Mir Danish Ahmed
Together, these teams ensure that the AWS Club runs efficiently, providing
members with opportunities to learn, collaborate, and grow within the cloud
computing domain. The clear structure and division of responsibilities allow
each team to focus on their core functions, ensuring the success of the club's
activities and initi",


  "MJCET info.pdf": "Muffakham Jah College of Engineering and Technology:-
  Established in the year 1980 under Sultan-Ul-Uloom Education Society (SUES), Muffakham
  Jah College of Engineering and Technology is a Minority Educational Institution affiliated
  to Osmania University, Hyderabad and approved by AICTE, New Delhi and accredited by
  the NAAC with Grade A+ and the Institution of Engineers, India. Located at Banjara Hills
  and spread over a sprawling 25 acre of land, the college with its serene and picturesque
  natural landscape is an ideal destination in all aspects to create innovative engineers to
  face the cut-throat competitions in the global technological scenario. With a glorious past
  and its current initiatives in terms of state of the art infrastructural facility, motivated
  faculty,scope of internship, research, association with industry and an enviable number of
  placements, the college has materialized the dreams of innumerable young minds to
  contribute in the field of science and technology and emerge victorious.
  Muffakham Jah College of Engineering and Technology is a
  premier institute of its kind, offering four year B.E. degree courses in 7 Engineering
  branches, namely, Civil Engineering, Computer Science Engineering, Computer Science
  Engineering (Artificial Intelligence), Computer Science Engineering (Artificial Intelligence &
  Machine Learning), Computer Science Engineering (Data Science), Electronics and
  Communication Engineering, Mechanical Engineering and four post graduate courses in
  M.E. (CAD/CAM), M.E. (Structural Engineering), M.E. (Embedded Systems & VLSI Design), M.
  Tech. (Computer Science) of two years duration. The College is a Minority Educational
  Insitution affiliated to Osmania University and is approved by the AICTE and accredited by
  the NAAC with Grade A+
  .
  LOCATION:-
  State, India
  Mount Pleasant, 8-2-249 to 267, Road No. 3, Banjara Hills, Hyderabad - 500 034, Telangana
  Innovatia Panoply 2024:-
  Computer Science & Engineering Department hosted a project exhibition on 27th July
  2024 showcasing a variety of innovative projects undertaken by students, alongside the
  Annual Day celebrations. The event featured creative projects demonstrating the
  students’ technical proficiency and inventiveness. The project exhibition featured 80
  projects, including cloud-based and AI-powered chatbots, IoT-based solutions, and
  marketing and management projects. Students demonstrated their ideas, explaining the
  technical aspects and potential applications to judges from both industry and academia.
  The best projects were awarded cash prizes, and academic awards were given to the top-
  performing students. The well-attended event saw the participation of 650 professionals,
  teachers, and students.
  AICTE VAANI 2024:-
  A three-day workshop titled “Next Gen Communications” was organized by department of
  Electronics and Communication Engineering, Muffakham Jah College of Engineering and
  Technology between 18/07/2024 to 20/07/2024.This was approved by All India Council for
  Technical Education (AICTE). This Workshop marks a landmark three-day event dedicated
  to exploring the frontiers of next-generation communication technologies. The inaugural
  was held on 18/07/2024 which was graced by Janab Mohammed Ibrahim Ali Siddiqui,
  Member, Board of Governors, Dr. Anupama Koneru, Principal, SUCP, Dr. Lakshmi Rawat,
  Director, AAKCBA. The medium of delivery of sessions was in Urdu.
  Expogenix’24:-
  The Computer Science & Artificial Intelligence Department of Muffakham Jah College of
  Engineering and Technology hosted Expogenix’24, a pioneering initiative to showcase
  innovative AI projects. The event featured groundbreaking technological work by students,
  with 76 teams presenting their projects, which integrated IoT sensors, AR-VR,
  telemedicine, fintech, and other state-of-the-art technologies. The projects were
  evaluated by a distinguished jury from CDAC, who awarded the top projects of
  Expogenix’24.
  Innovator's Fest 2024:-
  The SU Knowledge Hub Foundation (SUKHF), an academic start-up incubator by the
  Sultan-Ul-Uloom Education Society, hosted the “Innovator's Fest 24” at Ghulam Ahmed
  Auditorium, SUES Campus, Banjara Hills. The event, held in collaboration with associate
  partner Emiratiyo Investments, aimed to provide a platform for budding entrepreneurs to
  showcase their innovative ideas. The Chief Guest Shri. Srinivas Rao Mahankali, CEO of T-
  Hub, Hyderabad, in his inaugural speech, highlighted the crucial role of academic
  institutions in fostering an entrepreneurial ecosystem.
  Departments and Courses in MJCET:-
  1)Civil Engineering:- UG - BE Civil Engineering, PG - ME Structural Engineering, Ph.
  D.
  2)CS & AI:- UG – BE (AI & DS), UG – BE (AI & ML), UG - BE CSE (AI), UG - BE CSE (AIML),
  UG - BE CSE (DS)
  3)CSE:- UG - BE CSE, PG - M.Tech. CSE, Ph. D.
  4) Electrical Engineering:- UG - BE EEE, PG - ME PES, Ph. D.
  5) ECE:- UG - BE ECE, PG - ME Digital Systems, PG - ME Embedded Systems & VLSI
  Design, Ph. D.
  6) Information Technology:- UG - BE Information Technology
  7) Mechanical Engineering:- UG - BE Mechanical Engineering, PG - ME CAD/CAM,
  Ph. D.
  8) Basic Sciences & Humanities:- This department comprises of Mathematics,
  Physics, Chemistry & English Sections
  SU Knowledge Hub Foundation:-
  We’re an academic startup incubator that fosters idea formulation and the establishment of
  startups addressing current and future societal and industrial needs. With state of the art
  infrastructure, including advanced hardware and software labs, and co-working spaces, the
  incubator offers a platform for students, academia, and early-stage startups to embark on
  technology-based business ventures. Startups are granted access to the SUKHF's wealth of
  offerings — think workshops, experts, mentors, funding opportunities, and an invaluable
  community of like-minded peers — all curated to help them explore their ideas and accelerate idea
  growth and venture building.
  WHY CHOOSE SU Knowledge Hub Foundation:-
  1. Technical Mentorship
  Patient and supportive technical mentors, always ready to provide guidance and constructive
  feedback, accompanies every startup at SUKHF. Strong technical background and experience in
  their relevant fields are their forte.
  2. Industry Connect
  Having a strong and vibrant network of industry connections benefits our startups, providing
  access to information, resources, and opportunities for growth and success. We've connections
  and relationships with key players in the industry, including suppliers, customers, competitors,
  regulators, and industry influencers. environment that helps startups thrive.
  3. Infrastructure
  An infrastructure that's flexible, scalable, and accessible, providing startups with the resources
  and support they need to succeed. It is designed to nurture collaboration and community,
  creating an environment that encourages innovation and entrepreneurial spirit.
  4. Funding
  Startup funding varies depending on the specific needs of the startup and at our end it's designed
  to support the long-term success and sustainability of the startup. It allows the startup to secure
  the right financing at the right time to support their growth and development.
  5. Community
  We have a community of entrepreneurs, mentors, investors, and experts that work together to
  help startups. It is dynamic, ever evolving to meet the changing needs of startups as they grow
  and develop.
  6. Prototyping & GTM
  With iterative and flexible prototyping, allowing for quick and efficient testing and refinement of
  the product design, the go-to-market (GTM) strategy is a must. The GTM strategies are based on a
  thorough understanding of the target market, competitive landscape, customer needs, which
  clearly communicates the value and benefits of the product or service to the target customers.
  SU Knowledge Hub Foundation programs:-
  We offers specially crafted Pre-Incubation program designed to help indiviuals turn their ideas
  into realistic and fundamentally sound startups. It involves personalized guidance and on-
  demand access to a wide range of resources including workshops, experts, mentors, funding
  opportunities, and a supportive community of like-minded peers.
  Mission of MJCET:-
  1)To attain excellence in imparting technical education from the undergraduate to through
  doctoral levels by adopting coherent and judiciously coordinated curricular and co-curricular
  programs.
  2)To foster a partnership with industry and Governmental agencies through collaborative
  research and consultancy.
  3)To nurture and strengthen auxiliary soft skills for overall development and improved
  employability in a multicultural workspace.
  4)To develop scientific temper and spirit of enquiry in order to harness the innovative talents.
  5)To develop a constructive attitude in the students towards the task of nation-building and
  empower them to become future leaders.
  6)To nourish the entrepreneurial instincts of the students and hone their business acumen.
  7)To involve the student and faculty in solving local community problems through economical and
  sustainable solutions.
  Vision of MJCET:-
  To be a part of the universal human quest for development and progress by contributing high
  calibre, ethical and socially responsible engineers who meet the global challenge of building a
  modern society in harmony with nature."
}
